Revit 2025 API
ConcreteBrightmodeType Enumeration
 The enumerated type representing the permitted values for the asset property "ConcreteBrightmode" from the "Concrete" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ConcreteBrightmodeType
Public Enumeration ConcreteBrightmodeType
public enum class ConcreteBrightmodeType
type ConcreteBrightmodeType
Members
Member name | Value | Description
None | 0
Automatic | 1
Custom | 2
See Also
Reference
Autodesk.Revit.DB.Visual Namespace